#include <stdio.h> //эт библиотека))

int main () {//основной цикл, представьте себе?!?!??!
    int data,god;//обозначаем переменные
    scanf("%d %d", &data,&god);//вводим переменные
//%Д обозначает ввод положительных чисел(я ушоке)
//%Ф обозначает переменную типа флоат
    if(data == 4 || data == 6 || data == 9 || data == 11) {
        printf("30");//ИФ на константы в месяцах в которых по 30 дней по их номмеру соответственно
    }
    else if(data == 1 || data == 3 || data == 5 || data == 7 || data == 8 || data == 10 || data == 12) {
        printf("31");//ИФ на месяца в которых по 31 дню
    }
    else if((god % 4 == 0 && god % 100 != 0)) {
        printf("29");//сейчас будет разнос, пошел февраль, я нашла какую-то формулу для обозначения високосный год 
    }
    else {
        printf("28");//а иначе там будет 28 дней
    }
    return 0;//великие боги программирования сказли мне, что РЕТЕРН 0 обязательно к написанию в конце программы для очищения кеша)))) теперь все будет летать
}//вообщем это было похоже на башню в москва сити МЕРКУРИЙ СИТИ, но 3 строчка все портит(((((((((((((