 #include <stdio.h>

 int main () {
    float z = 0;//как я уже говорила ранее эти переменные могут быть дробными
    float obchee = 0;
    float n = 0;
    float stop = 0;
    do {//делаем пока
        scanf("%f", &stop);//вводим числа
        obchee = obchee + stop;//узнаем ОБЩЕЕ
        n = n + 1;//счетчик
    } while (stop != 0);//а вот и наше условие ввода если переменная СТОП будет равна нулю =>стоп
    z = obchee / (n - 1);//Н-1 потому что учитывается ноль который останавливает ввод
    printf("%f", z);//дам миру узреть наш ответ
    return 0;
 }