#include <stdio.h>

int main () { 
    int m;//кол-во основных чисел
    int chisla = 0;//счетчик положительных чисел
    int number;//основные числа
    scanf("%d", &m);//ввод числа обозначающее кол-во М
    for (int i = 0; i < m; i++) {//я делаю цикл для продолжения нашей увлекательной истории программирования этой ужасной задачи, я устала, можно зачет автоматом?))
        scanf("%d", &number);//ввод основных чисел
        if(number > 0) {//если числа положительные идем по условию
            chisla = chisla + 1;//считаем чиселки
        }
    }
    printf("%d", chisla);//выводим--------------------------------------------------------
    return 0;
}